QX-20_TO/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    airplane.obj
    {
        type triSurfaceMesh;
        name airplane;
    }

    refinementBox
    {
        type searchableBox;
        min  (-1.7 -14.2 -1.1);
        max  (30.0 14.2 2.8);
    }
}

castellatedMeshControls
{
    maxLocalCells           1500000;
    maxGlobalCells          3000000;
    minRefinementCells      10;
    maxLoadUnbalance        0.10;
    nCellsBetweenLevels     3;

    features
    (
        {
            file            "airplane.eMesh";
            level           6;
        }
    );

    refinementSurfaces
    {
        airplane
        {
            level           (6 6);
            patchInfo
            {
                type        wall;
                inGroups    (airplaneGroup);
            }
        }
    }

    resolveFeatureAngle     30;

    refinementRegions
    {
        refinementBox
        {
            mode            inside;
            levels          ((1E15 4));
        }
    }

    locationInMesh          (-1.0 0.0 -1.0);
    allowFreeStandingZoneFaces  true;
}

snapControls
{
    nSmoothPatch            3;
    tolerance               1.0;
    nSolveIter              30;
    nRelaxIter              5;

    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

addLayersControls
{
    relativeSizes           true;

    layers
    {
        airplane
        {
            nSurfaceLayers  2;
        }
        maxY
        {
            nSurfaceLayers  2;

        }
        frozenPatches
        {
            nSurfaceLayers  0;
        }
    }

    expansionRatio          2.0;
    finalLayerThickness     0.4;
    minThickness            0.2;
    nGrow                   0;

    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              3;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio   0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho             45;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minVol                  1e-13;
    minTetQuality           -1e+30;
    minArea                 -1;
    minTwist                0.05;
    minDeterminant          0.001;
    minFaceWeight           0.05;
    minVolRatio             0.01;    
    minTriangleTwist        -1;

    nSmoothScale            4;
    errorReduction          0.75;
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance              1e-6;


// ************************************************************************* //